[
  {
    "id": "The Fool",
    "name": "The Divine Child",
    "white_star_meaning": "Pure potential, trust in the universe's unfolding",
    "narrative_passage": "In the beginning, there was only the spark of infinite possibility. You are that spark - uncluttered by past wounds, unbound by future fears. Step forward with the innocence of a child born into wonder, for the universe conspires to guide your feet along paths of light.",
    "combat_effect": "Gain 2 Energy at start of combat. Draw 1 extra card.",
    "exploration_effect": "Reveals hidden paths and secret rooms. Treasure rooms have 50% better loot.",
    "evolution_meaning": "Beginning of transformation journey. Unlocks potential for all future evolutions.",
    "rarity": "common",
    "element_affinity": ["spirit"]
  },
  {
    "id": "The Magician",
    "name": "The Conscious Creator",
    "white_star_meaning": "Manifestation through awakened will",
    "narrative_passage": "You are the bridge between heaven and earth, the alchemist of consciousness. Every thought becomes reality, every intention shapes destiny. Stand in your power, for you are the magician who transforms the lead of limitation into the gold of enlightenment.",
    "combat_effect": "25% increased spell damage. Cards cost 1 less energy.",
    "exploration_effect": "Arcane rooms always appear. Mana crystals restore double energy.",
    "evolution_meaning": "Awakens creative potential. Enables advanced spell weaving.",
    "rarity": "common",
    "element_affinity": ["fire", "spirit"]
  },
  {
    "id": "The High Priestess",
    "name": "The Inner Wisdom",
    "white_star_meaning": "Intuitive knowing beyond the veil",
    "narrative_passage": "Behind the curtain of ordinary perception lies the temple of inner wisdom. You are the guardian of mysteries, the voice of intuition that whispers truths your rational mind cannot yet comprehend. Trust the silent knowing that guides you toward revelation.",
    "combat_effect": "See enemy intents. 15% defense against magical attacks.",
    "exploration_effect": "Reveals true nature of rooms before entering. Event rooms have positive outcomes.",
    "evolution_meaning": "Unlocks psychic abilities. Enhances intuitive decision making.",
    "rarity": "common",
    "element_affinity": ["water", "spirit"]
  },
  {
    "id": "The Empress",
    "name": "The Divine Mother",
    "white_star_meaning": "Creative abundance and unconditional love",
    "narrative_passage": "You are the embodiment of creation's loving embrace, the fertile ground from which all beauty springs. Your heart overflows with nurturing wisdom, reminding all beings of their inherent worth and the abundance that flows when we align with nature's generous rhythm.",
    "combat_effect": "Healing spells 50% more effective. Regenerate 5 HP per turn.",
    "exploration_effect": "Rest rooms provide double healing. Food/treasure rooms have bonus rewards.",
    "evolution_meaning": "Enhances emotional intelligence. Strengthens healing abilities.",
    "rarity": "common",
    "element_affinity": ["earth", "water"]
  },
  {
    "id": "The Emperor",
    "name": "The Wise Protector",
    "white_star_meaning": "Divine structure and benevolent authority",
    "narrative_passage": "You are the mountain that shelters, the oak that roots deeply into wisdom. Your strength serves not domination, but the creation of safe space for growth. Rule with the compassion of one who understands that true power blooms in service to the greater good.",
    "combat_effect": "30% increased physical damage. 20 additional defense.",
    "exploration_effect": "Boss rooms are less dangerous. Enemy encounters have fewer monsters.",
    "evolution_meaning": "Develops leadership qualities. Strengthens protective abilities.",
    "rarity": "common",
    "element_affinity": ["earth", "fire"]
  },
  {
    "id": "The Hierophant",
    "name": "The Awakened Guide",
    "white_star_meaning": "Sacred wisdom shared through love",
    "narrative_passage": "You are the bridge between ancient knowing and emerging consciousness, the teacher who illuminates rather than dictates. Your wisdom flows not from dusty tomes, but from the living light of direct experience, shared freely with all who seek understanding.",
    "combat_effect": "Allies in combat get 15% to all stats. Teaching cards become available.",
    "exploration_effect": "Libraries and study rooms provide bonus experience. NPCs share valuable information.",
    "evolution_meaning": "Unlocks mentorship abilities. Enhances knowledge transfer.",
    "rarity": "uncommon",
    "element_affinity": ["spirit", "air"]
  },
  {
    "id": "The Lovers",
    "name": "The Unified Heart",
    "white_star_meaning": "Sacred union of opposites",
    "narrative_passage": "You are the dance of duality resolved in harmony, the recognition that separation is illusion. In your heart, the divine masculine and feminine energies entwine, creating wholeness from apparent division. Love becomes the alchemical force that transmutes conflict into understanding.",
    "combat_effect": "Dual-wielding bonuses. Partner cards available for combo attacks.",
    "exploration_effect": "Companion NPCs join your journey. Relationship-based events occur.",
    "evolution_meaning": "Achieves inner balance. Unlocks relationship dynamics.",
    "rarity": "uncommon",
    "element_affinity": ["water", "fire"]
  },
  {
    "id": "The Chariot",
    "name": "The Triumphant Will",
    "white_star_meaning": "Focused determination conquers all obstacles",
    "narrative_passage": "You are the unwavering force that moves mountains through sheer will and clarity of purpose. Victory comes not through brute strength, but through the alignment of your entire being with your soul's highest calling. Forward momentum becomes inevitable when doubt dissolves in certainty.",
    "combat_effect": "50% increased speed. First strike in combat rounds.",
    "exploration_effect": "Movement through dungeon is faster. Shortcuts appear between floors.",
    "evolution_meaning": "Develops unshakeable determination. Overcomes inner obstacles.",
    "rarity": "uncommon",
    "element_affinity": ["fire", "air"]
  },
  {
    "id": "Strength",
    "name": "The Compassionate Warrior",
    "white_star_meaning": "True power through love and patience",
    "narrative_passage": "You are the lion tamer whose strength flows not from domination, but from the quiet power of compassion. Inner fortitude grows through gentle persistence, transforming potential conflict into harmonious resolution. True strength whispers where others shout.",
    "combat_effect": "Tame enemies instead of killing them. Convert monsters to temporary allies.",
    "exploration_effect": "Wild areas become peaceful. Dangerous rooms become safe havens.",
    "evolution_meaning": "Masters emotional control. Transforms aggression into compassion.",
    "rarity": "uncommon",
    "element_affinity": ["earth", "spirit"]
  },
  {
    "id": "The Hermit",
    "name": "The Solitary Sage",
    "white_star_meaning": "Wisdom found in sacred isolation",
    "narrative_passage": "You are the light that shines brightest in solitude, the seeker who finds universal truths in the quiet chamber of the soul. Retreat becomes not escape, but the necessary journey inward where the greatest treasures of wisdom await discovery.",
    "combat_effect": "Invisibility and evasion abilities. Enemies have reduced accuracy.",
    "exploration_effect": "Hidden rooms and secret chambers revealed. Meditative spots restore full energy.",
    "evolution_meaning": "Deepens inner wisdom. Unlocks contemplative abilities.",
    "rarity": "uncommon",
    "element_affinity": ["spirit"]
  },
  {
    "id": "Wheel of Fortune",
    "name": "The Eternal Cycle",
    "white_star_meaning": "Divine timing in constant motion",
    "narrative_passage": "You are part of the great cosmic dance where everything moves in perfect rhythm. What appears as random chance is actually the universe's loving guidance, turning every ending into a new beginning, every challenge into an opportunity for growth.",
    "combat_effect": "Random beneficial effects each turn. Luck-based cards become more powerful.",
    "exploration_effect": "Random events occur more frequently, usually positive. Fortune rooms appear.",
    "evolution_meaning": "Understands cosmic timing. Works with universal flow.",
    "rarity": "rare",
    "element_affinity": ["spirit", "air"]
  },
  {
    "id": "Justice",
    "name": "The Balanced Heart",
    "white_star_meaning": "Divine balance through compassion",
    "narrative_passage": "You are the scales perfectly balanced, not through rigid judgment, but through the deeper wisdom of understanding. True justice flows from the heart's knowing that we are all interconnected, and every action sends ripples through the web of existence.",
    "combat_effect": "Perfect accuracy. Counter-attack abilities.",
    "exploration_effect": "Truth-revealing rooms. Merchants offer fair prices.",
    "evolution_meaning": "Develops discernment. Balances all aspects of self.",
    "rarity": "rare",
    "element_affinity": ["air", "spirit"]
  },
  {
    "id": "The Hanged Man",
    "name": "The Surrendered Trust",
    "white_star_meaning": "Wisdom through voluntary release",
    "narrative_passage": "You are the one who chooses to surrender, not as defeat, but as the ultimate act of trust in the universe's plan. In letting go, you discover that true freedom comes not from clinging, but from the graceful dance of surrender and renewal.",
    "combat_effect": "Sacrifice HP for powerful effects. Transformation abilities.",
    "exploration_effect": "Sacrifice rooms offer great rewards. Traps can be turned to advantages.",
    "evolution_meaning": "Masters detachment. Transforms through surrender.",
    "rarity": "rare",
    "element_affinity": ["water", "spirit"]
  },
  {
    "id": "Death",
    "name": "The Beautiful Death",
    "white_star_meaning": "Graceful transformation through release",
    "narrative_passage": "You are in the midst of beautiful transition, where what no longer serves your soul's evolution gracefully falls away. This is not an ending, but the necessary pause before rebirth, where the old makes way for the infinitely more beautiful becoming.",
    "combat_effect": "Transform defeated enemies into beneficial spirits. Evolution triggers.",
    "exploration_effect": "Death/rebirth rooms appear. Old items can be transmuted to better ones.",
    "evolution_meaning": "Major transformation milestone. Sheds limiting patterns.",
    "rarity": "rare",
    "element_affinity": ["water", "earth"]
  },
  {
    "id": "Temperance",
    "name": "The Divine Balance",
    "white_star_meaning": "Sacred alchemy of opposites",
    "narrative_passage": "You are the alchemist of consciousness, blending seemingly opposite forces into perfect harmony. Patience becomes your greatest ally as you learn that true transformation happens not through force, but through the gentle art of sacred balance.",
    "combat_effect": "Combine card effects. Elemental balance bonuses.",
    "exploration_effect": "Alchemy labs appear. Items can be combined for enhanced effects.",
    "evolution_meaning": "Achieves inner alchemy. Balances all elements within.",
    "rarity": "rare",
    "element_affinity": ["water", "fire"]
  },
  {
    "id": "The Devil",
    "name": "The Inner Liberation",
    "white_star_meaning": "Freedom from self-imposed limitations",
    "narrative_passage": "You are breaking free from the chains you once thought were unbreakable. What appeared as external oppression was actually the mirror of inner limitations. Now you see that true freedom comes from within, as you dissolve the illusions that once held you captive.",
    "combat_effect": "Break enemy chains and restrictions. Freedom-based attacks.",
    "exploration_effect": "Prison rooms become liberation opportunities. Cursed items can be purified.",
    "evolution_meaning": "Liberates from past traumas. Unlocks true freedom.",
    "rarity": "rare",
    "element_affinity": ["fire", "earth"]
  },
  {
    "id": "The Tower",
    "name": "The Sudden Light",
    "white_star_meaning": "Breakthrough through divine intervention",
    "narrative_passage": "You are experiencing the beautiful destruction that precedes rebirth, as outdated structures crumble to make way for truer forms. This apparent chaos is actually the universe's loving hand clearing space for structures built on authentic foundation.",
    "combat_effect": "Destroy enemy defenses. Breakthrough attacks ignore armor.",
    "exploration_effect": "Collapsing rooms reveal hidden treasures. Old paths become new opportunities.",
    "evolution_meaning": "Sudden awakening. Breaks through limiting beliefs.",
    "rarity": "epic",
    "element_affinity": ["fire", "air"]
  },
  {
    "id": "The Star",
    "name": "The Guiding Light",
    "white_star_meaning": "Hope and inspiration from divine source",
    "narrative_passage": "You are the star that guides weary travelers through the darkest nights, the beacon of hope that reminds all beings of their divine origin. Your light shines not from effort, but from the simple truth of who you are - a radiant expression of cosmic love.",
    "combat_effect": "Inspire allies with hope buffs. Light-based attacks.",
    "exploration_effect": "Star rooms provide guidance and direction. Lost paths become clear.",
    "evolution_meaning": "Connects to divine inspiration. Illuminates true purpose.",
    "rarity": "epic",
    "element_affinity": ["spirit", "water"]
  },
  {
    "id": "The Moon",
    "name": "The Luminous Mystery",
    "white_star_meaning": "Sacred wisdom of the subconscious",
    "narrative_passage": "You are navigating the luminous waters of the subconscious, where dreams and reality dance in sacred interplay. What others fear as unknown territory, you embrace as the birthplace of intuition and the wellspring of creative potential.",
    "combat_effect": "Illusion and deception abilities. Mind-affecting attacks.",
    "exploration_effect": "Dream rooms appear with prophetic visions. Hidden meanings revealed.",
    "evolution_meaning": "Masters subconscious mind. Unlocks dream work abilities.",
    "rarity": "epic",
    "element_affinity": ["water", "spirit"]
  },
  {
    "id": "The Sun",
    "name": "The Perfect Joy",
    "white_star_meaning": "Divine illumination and celebration",
    "narrative_passage": "You are the sun that warms all with unconditional love, the radiant joy that reminds every being of their inherent worthiness. In your light, shadows dissolve, fears evaporate, and the simple truth of universal love becomes self-evident.",
    "combat_effect": "Radiant damage burns enemies. Joy-based buffs for allies.",
    "exploration_effect": "Sunny rooms provide warmth and comfort. Dark areas become illuminated.",
    "evolution_meaning": "Achieves enlightenment. Radiates love and joy.",
    "rarity": "epic",
    "element_affinity": ["fire", "spirit"]
  },
  {
    "id": "Judgement",
    "name": "The Soul's Resurrection",
    "white_star_meaning": "Divine call to authentic purpose",
    "narrative_passage": "You are hearing the trumpet call of your soul's highest purpose, awakening from the slumber of limited identity. This is not judgment, but the loving invitation to step fully into the magnificent being you were always meant to become.",
    "combat_effect": "Resurrection abilities. Transformative attacks that evolve enemies.",
    "exploration_effect": "Awakening rooms trigger profound insights. Lost souls find peace.",
    "evolution_meaning": "Soul-level transformation. Discovers true calling.",
    "rarity": "legendary",
    "element_affinity": ["spirit", "fire"]
  },
  {
    "id": "The World",
    "name": "The Unified Consciousness",
    "white_star_meaning": "Complete harmony with all existence",
    "narrative_passage": "You are the dancer in perfect harmony with the cosmos, where individual consciousness merges with universal awareness. The journey completes itself in this moment of recognition that separation was always illusion, and unity is our natural state of being.",
    "combat_effect": "Unity with all beings. Cosmic damage affects all enemies.",
    "exploration_effect": "World rooms connect all areas. Universal harmony revealed.",
    "evolution_meaning": "Achieves complete integration. Becomes one with all existence.",
    "rarity": "legendary",
    "element_affinity": ["spirit"]
  }
]
